#### PointIterator Members

---

|  |
| --- |
| PointIterator Class   Methods   Properties   See Also |

The  PointIterator  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PointIterator |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | Free | Completes lifetime of the iterator. Call it when done using the iterator. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsDone | Identifies if the iteration has reached the end of the collection. |
| Public method | MoveNext | Increments the iterator to the next point in the collection. |
| Public method | Reset | Resets the iterator to the beginning of the collection. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Current |  |
| Public property | CurrentObject |  |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PointIterator Class

Autodesk.Revit.DB.PointClouds Namespace